In [2]:
import pandas as pd
import numpy as np

In [3]:
people=pd.DataFrame(np.random.randn(5,5),
                   columns=['a','b','c','d','e'],
                   index=['Joe','Steve','Wes','Jim','Travis'])

In [4]:
people.groupby(len).sum()

          a         b         c         d         e
3  2.598809  2.344184 -1.501479  1.857153 -0.398621
5 -1.010153 -0.912041  0.409028  0.931514 -0.196437
6  1.023978 -0.426599 -1.329322 -0.252198  0.265122

In [5]:
key_list=['one','one','one','two','two']

In [6]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.273203  0.562874 -1.561763 -1.096751 -0.448765
  two  1.395733  1.102152  0.287312  1.744300  0.389116
5 one -1.010153 -0.912041  0.409028  0.931514 -0.196437
6 two  1.023978 -0.426599 -1.329322 -0.252198  0.265122

In [7]:
columns=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],
                                  [1,3,5,1,3]],
                                 names=['cty','tenor'])

In [8]:
hier_df=pd.DataFrame(np.random.randn(4,5), columns=columns)

In [9]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.210102 -0.587435  1.699345  1.082909 -0.403473
1     -0.945670  0.711212  0.534920 -0.730357  0.926028
2      0.242186 -0.803297 -0.461988  0.434106 -1.900301
3     -0.303450  0.904024  0.766196 -0.298505  0.877114

In [10]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3